CONCAT_KEY = '销售数据*.xlsx'
AUDIT_ONLY = False
CLEAN_PATTERN = r'[¥,]'
#MERGE_KEY_ON1 = {'商品主数据(1).xlsx':'商品编号','销售员主数据.xlsx':'销售员'}      #旧，已弃
COL_NAME_KEYWORD = {

    '订单号':'订单号',
    '订单编号':'订单号',
    '订单':'订单号',

    '日期':'日期',
    '销售日期':'日期',
    '记账日期':'日期',

    '门店':'门店编号',
    '门店编号':'门店编号',
    '门店名称/编号':'门店编号',
    '门店名称':'门店编号',

    '商品编号':'商品编号',
    '货号':'商品编号',
    'SKU':'商品编号',

    '数量':'数量',
    '销售数量':'数量',

    '单价':'单价',
    '含税单价':'单价',
    '售价':'单价',

    '折扣':'折扣',
    '折扣率':'折扣',

    '销售金额':'销售金额',
    '销售额':'销售金额',
    '实收金额':'销售金额',

    '销售人员编号':'销售人员编号',
    '销售员编号':'销售人员编号',
    '员工编号':'销售人员编号',
    '销售人员':'销售人员编号'

}
MERGE_KEY_ON2 = {'商品主数据.xlsx':{'left_on':'商品编号','right_on':'商品编号','how':'left'},
                '门店主数据.xlsx':{'left_on':'门店编号','right_on':'门店编号','how':'left'},
                 '销售人员主数据.xlsx':{'left_on':'销售人员编号','right_on':'销售人员编号','how':'left'}}
INPUT_FILENAME = '处理结果.xlsx'
SHEET_NAME = ['流水明细','商品类别汇总','门店汇总','区域汇总','月度汇总','销售人员汇总','异常报告']
COL_TIME = ['日期']
COL_MONEY = ['单价','销售金额']
COL_NUM = ['数量']
MONEY_KEY_WORDS = ['金额', '收入', '销售金额', '总计', 'Amount', 'Revenue', 'Total','单价']
TIME_KEY_WORDS = ['日期','时间']
MONEY_FORMAT = ['#,##0.00']
TIME_FORMAT = ['yyyy-mm-dd']